CSI API ETABS v1
cFile.Save Method
 Saves the present model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Save(
	string FileName = ""
)
Function Save (
	Optional FileName As String = ""
) As Integer
Dim instance As cFile
Dim FileName As String
Dim returnValue As Integer
returnValue = instance.Save(FileName)
int Save(
	String^ FileName = L""
)
abstract Save :
        ?FileName : string
(* Defaults:
        let _FileName = defaultArg FileName ""
*)
-> int
Parameters
FileName (Optional)
Type: System.String
 The full path to which the model file is saved.
Return Value
Type: Int32
 Returns zero if the file is successfully saved and nonzero if it is not saved.
Remarks
 If no file name is specified, the file is saved using its current name. If there is no current name for the file (the file has not been saved previously) and this function is called with no file name specified, an error will be returned.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'save file
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFile Interface
ETABSv1 Namespace